app/Models/productosModel.php

SELECT *
FROM `productos`
---
public function getProductos () {
    return $this->findAll();

SELECT *
FROM `productos`
WHERE `productos`.`id` = '22'
---
public function getProducto ($id) {
    return $this->find($id);